app/controllers/students_controller.rb

SELECT  "students".* FROM "students"  ORDER BY "students"."id" ASC LIMIT 1
---
  def index
    @students = Student.all

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    #p Student.all
    @student = Student.find(params[:id])